stress-tests/artillery.yml
# SpeakAble HK — Artillery API Load Test
# Install: npm install -g artillery
# Run:     artillery run stress-tests/artillery.yml
#
# Options:
#   artillery run --target http://localhost:8100 stress-tests/artillery.yml
#   artillery run --target https://nepa.speakable.hk/api stress-tests/artillery.yml

config:
  target: "{{$processEnvironment.TARGET || 'http://localhost:8100'}}"
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up"
    - duration: 20
      arrivalRate: 20
      name: "Sustain"
    - duration: 10
      arrivalRate: 20
      rampTo: 50
      name: "Spike"
    - duration: 10
      arrivalRate: 10
      rampTo: 0
      name: "Cooldown"
  defaults:
    headers:
      Content-Type: "application/json"
  payload:
    path: "patients.csv"
    fields:
      - "patientId"

scenarios:
  - name: "Therapist dashboard flow"
    weight: 3
    flow:
      - get:
          url: "/api/v1/dashboard/{{ patientId }}"
      - think: 1-3
      - get:
          url: "/api/v1/world-model/{{ patientId }}"

  - name: "NEPA recommendation flow"
    weight: 2
    flow:
      - post:
          url: "/api/v1/exercise/recommend?patient_id={{ patientId }}"
      - think: 1-2

  - name: "Student phoneme submission"
    weight: 3
    flow:
      - post:
          url: "/api/v1/speech/phonemes"
          formData:
            - audio:
                file: "sample-audio.webm"
                contentType: "audio/webm"
      - think: 2-5

  - name: "Student ASR"
    weight: 2
    flow:
      - post:
          url: "/api/v1/speech/asr"
          formData:
            - audio:
                file: "sample-audio.webm"
                contentType: "audio/webm"